## Joining Tables - Outer

Let us understand how to perform outer joins using SQL. There are 3 different types of outer joins.
* `LEFT OUTER JOIN` (default) - Get all the records from both the datasets which satisfies JOIN condition along with those records which are in the left side table but not in the right side table.
* `RIGHT OUTER JOIN` - Get all the records from both the datasets which satisfies JOIN condition along with those records which are in the right side table but not in the left side table.
* `FULL OUTER JOIN` - left union right
* When we perform the outer join (lets say left outer join), we will see this.
  * Get all the values from both the tables when join condition satisfies.
  * If there are rows on left side table for which there are no corresponding values in right side table, all the projected column values for right side table will be null.
* Here are some of the examples for outer join.
    * Get all the orders where there are no corresponding order items.
    * Get all the order items where there are no corresponding orders.

In [ ]:
%load_ext sql

In [ ]:
%env DATABASE_URL=postgresql://itversity_sms_user:itversity@localhost:5432/itversity_sms_db

In [ ]:
%%sql

SELECT * FROM users
ORDER BY 1

In [ ]:
%%sql

SELECT * FROM course_enrolments
ORDER BY 1

In [ ]:
%%sql

SELECT ce.enrolment_id,
    u.*,
    ce.course_id,
    ce.sale_date,
    ce.amount_paid
FROM users AS u
    JOIN course_enrolments AS ce
        ON u.user_id = ce.user_id
ORDER BY ce.enrolment_id

In [ ]:
%%sql

SELECT ce.enrolment_id,
    u.*,
    ce.course_id,
    ce.sale_date,
    ce.amount_paid
FROM users AS u
    LEFT OUTER JOIN course_enrolments AS ce
        ON u.user_id = ce.user_id
ORDER BY ce.enrolment_id

In [ ]:
%%sql

SELECT ce.enrolment_id,
    u.*,
    ce.course_id,
    ce.sale_date,
    ce.amount_paid
FROM course_enrolments AS ce
    RIGHT OUTER JOIN users AS u
        ON u.user_id = ce.user_id
ORDER BY ce.enrolment_id

In [ ]:
%%sql

SELECT ce.enrolment_id,
    ce.user_id,
    u.user_fname,
    u.user_lname,
    ce.course_id,
    ce.sale_date,
    ce.amount_paid
FROM users AS u
    RIGHT OUTER JOIN course_enrolments AS ce
        ON u.user_id = ce.user_id
ORDER BY ce.enrolment_id

In [ ]:
%%sql

SELECT ce.enrolment_id,
    ce.user_id,
    u.user_fname,
    u.user_lname,
    ce.course_id,
    ce.sale_date,
    ce.amount_paid
FROM course_enrolments AS ce
    LEFT OUTER JOIN users AS u
        ON u.user_id = ce.user_id
ORDER BY ce.enrolment_id

In [ ]:
%%sql

SELECT ce.enrolment_id,
    ce.user_id,
    c.*,
    ce.sale_date,
    ce.amount_paid
FROM courses AS c
    LEFT OUTER JOIN course_enrolments AS ce
        ON c.course_id = ce.course_id
ORDER BY ce.enrolment_id

In [ ]:
%%sql

SELECT ce.enrolment_id,
    ce.user_id,
    ce.course_id,
    c.course_title,
    c.course_price,
    ce.sale_date,
    ce.amount_paid
FROM courses AS c
    RIGHT OUTER JOIN course_enrolments AS ce
        ON c.course_id = ce.course_id
ORDER BY ce.enrolment_id

In [ ]:
%%sql

SELECT ce.enrolment_id,
    u.*,
    c.*,
    ce.sale_date,
    ce.amount_paid
FROM users AS u
    JOIN course_enrolments AS ce
        ON u.user_id = ce.user_id
    RIGHT OUTER JOIN courses AS c
        ON c.course_id = ce.course_id
ORDER BY ce.enrolment_id

In [ ]:
%%sql

-- Incorrect Solution
SELECT ce.enrolment_id,
    u.*,
    ce.course_id,
    ce.sale_date,
    ce.amount_paid
FROM users AS u
    LEFT OUTER JOIN course_enrolments AS ce
        ON u.user_id = ce.user_id
WHERE to_char(sale_date, 'yyyy-MM') = '2022-02'
    OR ce.user_id IS NULL
ORDER BY ce.enrolment_id

In [ ]:
%%sql

SELECT ce.enrolment_id,
    u.*,
    ce.course_id,
    ce.sale_date,
    ce.amount_paid
FROM users AS u
    LEFT OUTER JOIN course_enrolments AS ce
        ON u.user_id = ce.user_id
            AND to_char(ce.sale_date, 'yyyy-MM') = '2022-02'
ORDER BY ce.enrolment_id

In [ ]:
%load_ext sql

In [ ]:
%env DATABASE_URL=postgresql://itversity_retail_user:itversity@localhost:5432/itversity_retail_db

In [ ]:
%%sql

SELECT * FROM information_schema.tables
WHERE table_schema = 'public'

In [ ]:
%%sql

SELECT * FROM orders LIMIT 10

In [ ]:
%%sql

SELECT * FROM order_items 
ORDER BY order_item_order_id
LIMIT 10

In [ ]:
%%sql

SELECT o.*,
    oi.order_item_order_id,
    oi.order_item_product_id,
    oi.order_item_subtotal
FROM orders AS o
    JOIN order_items AS oi
        ON o.order_id = oi.order_item_order_id
ORDER BY o.order_id
LIMIT 10

In [ ]:
%%sql

SELECT count(*) FROM order_items

In [ ]:
%%sql

SELECT count(*)
FROM orders AS o
    JOIN order_items AS oi
        ON o.order_id = oi.order_item_order_id

In [ ]:
%%sql

SELECT o.*,
    oi.order_item_order_id,
    oi.order_item_product_id,
    oi.order_item_subtotal
FROM orders AS o
    LEFT OUTER JOIN order_items AS oi
        ON o.order_id = oi.order_item_order_id
ORDER BY o.order_id
LIMIT 10

In [ ]:
%%sql

SELECT count(*)
FROM orders AS o
    LEFT OUTER JOIN order_items AS oi
        ON o.order_id = oi.order_item_order_id

In [ ]:
%sql SELECT 183650 - 172198

In [ ]:
%sql SELECT count(*) FROM orders

In [ ]:
%sql SELECT count(DISTINCT order_item_order_id) FROM order_items

In [ ]:
%%sql

SELECT o.*,
    oi.order_item_subtotal,
    p.product_id,
    p.product_name
FROM orders AS o
    LEFT OUTER JOIN order_items AS oi
        ON o.order_id = oi.order_item_order_id
    LEFT OUTER JOIN products AS p
        ON p.product_id = oi.order_item_product_id
ORDER BY o.order_id
LIMIT 10

In [ ]:
%%sql

SELECT * FROM products LIMIT 10